aws/amazon-freertos/vendors/ti/SimpleLink_CC32xx/v4_30_00_06/source/ti/drivers/itm/hw_cpu_scs.h
// Field:     [0] SEPARATE
//
// The processor core uses only a unified MPU, thus this field is always 0.
#define CPU_SCS_MPU_TYPE_SEPARATE                                   0x00000001
#define CPU_SCS_MPU_TYPE_SEPARATE_BITN                                       0
#define CPU_SCS_MPU_TYPE_SEPARATE_M                                 0x00000001
#define CPU_SCS_MPU_TYPE_SEPARATE_S                                          0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_CTRL
//
//*****************************************************************************
// Field:     [2] PRIVDEFENA
//
// This bit enables the default memory map for privileged access, as a
// background region, when the MPU is enabled. The background region acts as if
// it was region number 1 before any settable regions. Any region that is set
// up overlays this default map, and overrides it. If this bit is not set, the
// default memory map is disabled, and memory not covered by a region faults.
// This applies to memory type, Execute Never (XN), cache and shareable rules.
// However, this only applies to privileged mode (fetch and data access). User
// mode code faults unless a region has been set up for its code and data. When
// the MPU is disabled, the default map acts on both privileged and user mode
// code. XN and SO rules always apply to the system partition whether this
// enable is set or not. If the MPU is disabled, this bit is ignored.
#define CPU_SCS_MPU_CTRL_PRIVDEFENA                                 0x00000004
#define CPU_SCS_MPU_CTRL_PRIVDEFENA_BITN                                     2
#define CPU_SCS_MPU_CTRL_PRIVDEFENA_M                               0x00000004
#define CPU_SCS_MPU_CTRL_PRIVDEFENA_S                                        2

// Field:     [1] HFNMIENA
//
// This bit enables the MPU when in Hard Fault, NMI, and FAULTMASK escalated
// handlers. If this bit and ENABLE are set, the MPU is enabled when in these
// handlers. If this bit is not set, the MPU is disabled when in these
// handlers, regardless of the value of ENABLE bit. If this bit is set and
// ENABLE is not set, behavior is unpredictable.
#define CPU_SCS_MPU_CTRL_HFNMIENA                                   0x00000002
#define CPU_SCS_MPU_CTRL_HFNMIENA_BITN                                       1
#define CPU_SCS_MPU_CTRL_HFNMIENA_M                                 0x00000002
#define CPU_SCS_MPU_CTRL_HFNMIENA_S                                          1

// Field:     [0] ENABLE
//
// Enable MPU
//
// 0: MPU disabled
// 1: MPU enabled
#define CPU_SCS_MPU_CTRL_ENABLE                                     0x00000001
#define CPU_SCS_MPU_CTRL_ENABLE_BITN                                         0
#define CPU_SCS_MPU_CTRL_ENABLE_M                                   0x00000001
#define CPU_SCS_MPU_CTRL_ENABLE_S                                            0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RNR
//
//*****************************************************************************
// Field:   [7:0] REGION
//
// Region select field.
// This field selects the region to operate on when using the MPU_RASR and
// MPU_RBAR. It must be written first except when the address MPU_RBAR.VALID
// and MPU_RBAR.REGION fields are written, which overwrites this.
#define CPU_SCS_MPU_RNR_REGION_W                                             8
#define CPU_SCS_MPU_RNR_REGION_M                                    0x000000FF
#define CPU_SCS_MPU_RNR_REGION_S                                             0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RBAR
//
//*****************************************************************************
// Field:  [31:5] ADDR
//
// Region base address field.
// The position of the LSB depends on the region size, so that the base address
// is aligned according to an even multiple of size. The power of 2 size
// specified by the SZENABLE field of the MPU Region Attribute and Size
// Register defines how many bits of base address are used.
#define CPU_SCS_MPU_RBAR_ADDR_W                                             27
#define CPU_SCS_MPU_RBAR_ADDR_M                                     0xFFFFFFE0
#define CPU_SCS_MPU_RBAR_ADDR_S                                              5

// Field:     [4] VALID
//
// MPU region number valid:
// 0: MPU_RNR remains unchanged and is interpreted.
// 1: MPU_RNR is overwritten by REGION.
#define CPU_SCS_MPU_RBAR_VALID                                      0x00000010
#define CPU_SCS_MPU_RBAR_VALID_BITN                                          4
#define CPU_SCS_MPU_RBAR_VALID_M                                    0x00000010
#define CPU_SCS_MPU_RBAR_VALID_S                                             4

// Field:   [3:0] REGION
//
// MPU region override field
#define CPU_SCS_MPU_RBAR_REGION_W                                            4
#define CPU_SCS_MPU_RBAR_REGION_M                                   0x0000000F
#define CPU_SCS_MPU_RBAR_REGION_S                                            0

//*****************************************************************************
//
// Register: CPU_SCS_O_MPU_RASR
//
//*****************************************************************************
// Field:    [28] XN
//
// Instruction access disable:
// 0: Enable instruction fetches
// 1: Disable instruction fetches
#define CPU_SCS_MPU_RASR_XN                                         0x10000000
#define CPU_SCS_MPU_RASR_XN_BITN                                            28
#define CPU_SCS_MPU_RASR_XN_M                                       0x10000000
#define CPU_SCS_MPU_RASR_XN_S                                               28

// Field: [26:24] AP
//
// Data access permission:
// 0x0: Priviliged permissions: No access. User permissions: No access.
// 0x1: Priviliged permissions: Read-write. User permissions: No access.
// 0x2: Priviliged permissions: Read-write. User permissions: Read-only.
// 0x3: Priviliged permissions: Read-write. User permissions: Read-write.
// 0x4: Reserved
// 0x5: Priviliged permissions: Read-only. User permissions: No access.
// 0x6: Priviliged permissions: Read-only. User permissions: Read-only.
// 0x7: Priviliged permissions: Read-only. User permissions: Read-only.
#define CPU_SCS_MPU_RASR_AP_W                                                3
#define CPU_SCS_MPU_RASR_AP_M                                       0x07000000
#define CPU_SCS_MPU_RASR_AP_S                                               24

