aws/amazon-freertos/vendors/ti/SimpleLink_CC32xx/v4_30_00_06/source/ti/drivers/itm/hw_cpu_scs.h
// Field:     [8] VC_BUSERR
//
// Debug Trap on normal Bus error. Ignored when DHCSR.C_DEBUGEN is cleared.
#define CPU_SCS_DEMCR_VC_BUSERR                                     0x00000100
#define CPU_SCS_DEMCR_VC_BUSERR_BITN                                         8
#define CPU_SCS_DEMCR_VC_BUSERR_M                                   0x00000100
#define CPU_SCS_DEMCR_VC_BUSERR_S                                            8

// Field:     [7] VC_STATERR
//
// Debug trap on Usage Fault state errors. Ignored when DHCSR.C_DEBUGEN is
// cleared.
#define CPU_SCS_DEMCR_VC_STATERR                                    0x00000080
#define CPU_SCS_DEMCR_VC_STATERR_BITN                                        7
#define CPU_SCS_DEMCR_VC_STATERR_M                                  0x00000080
#define CPU_SCS_DEMCR_VC_STATERR_S                                           7

// Field:     [6] VC_CHKERR
//
// Debug trap on Usage Fault enabled checking errors. Ignored when
// DHCSR.C_DEBUGEN is cleared.
#define CPU_SCS_DEMCR_VC_CHKERR                                     0x00000040
#define CPU_SCS_DEMCR_VC_CHKERR_BITN                                         6
#define CPU_SCS_DEMCR_VC_CHKERR_M                                   0x00000040
#define CPU_SCS_DEMCR_VC_CHKERR_S                                            6

// Field:     [5] VC_NOCPERR
//
// Debug trap on a UsageFault access to a Coprocessor. Ignored when
// DHCSR.C_DEBUGEN is cleared.
#define CPU_SCS_DEMCR_VC_NOCPERR                                    0x00000020
#define CPU_SCS_DEMCR_VC_NOCPERR_BITN                                        5
#define CPU_SCS_DEMCR_VC_NOCPERR_M                                  0x00000020
#define CPU_SCS_DEMCR_VC_NOCPERR_S                                           5

// Field:     [4] VC_MMERR
//
// Debug trap on Memory Management faults. Ignored when DHCSR.C_DEBUGEN is
// cleared.
#define CPU_SCS_DEMCR_VC_MMERR                                      0x00000010
#define CPU_SCS_DEMCR_VC_MMERR_BITN                                          4
#define CPU_SCS_DEMCR_VC_MMERR_M                                    0x00000010
#define CPU_SCS_DEMCR_VC_MMERR_S                                             4

// Field:     [0] VC_CORERESET
//
// Reset Vector Catch. Halt running system if Core reset occurs. Ignored when
// DHCSR.C_DEBUGEN is cleared.
#define CPU_SCS_DEMCR_VC_CORERESET                                  0x00000001
#define CPU_SCS_DEMCR_VC_CORERESET_BITN                                      0
#define CPU_SCS_DEMCR_VC_CORERESET_M                                0x00000001
#define CPU_SCS_DEMCR_VC_CORERESET_S                                         0

//*****************************************************************************
//
// Register: CPU_SCS_O_STIR
//
//*****************************************************************************
// Field:   [8:0] INTID
//
// Interrupt ID field. Writing a value to this bit-field is the same as
// manually pending an interrupt by setting the corresponding interrupt bit in
// an Interrupt Set Pending Register in NVIC_ISPR0 or NVIC_ISPR1.
#define CPU_SCS_STIR_INTID_W                                                 9
#define CPU_SCS_STIR_INTID_M                                        0x000001FF
#define CPU_SCS_STIR_INTID_S                                                 0

//*****************************************************************************
//
// Register: CPU_SCS_O_FPCCR
//
//*****************************************************************************
// Field:    [31] ASPEN
//
// Automatic State Preservation enable.
// When this bit is set is will cause bit [2] of the Special CONTROL register
// to be set (FPCA) on execution of a floating point instruction which results
// in the floating point state automatically being preserved on exception
// entry.
#define CPU_SCS_FPCCR_ASPEN                                         0x80000000
#define CPU_SCS_FPCCR_ASPEN_BITN                                            31
#define CPU_SCS_FPCCR_ASPEN_M                                       0x80000000
#define CPU_SCS_FPCCR_ASPEN_S                                               31

// Field:    [30] LSPEN
//
// Lazy State Preservation enable.
// Lazy state preservation is when the processor performs a context save, space
// on the stack is reserved for the floating point state but it is not stacked
// until the new context performs a floating point operation.
// 0: Disable automatic lazy state preservation for floating-point context.
// 1: Enable automatic lazy state preservation for floating-point context.
#define CPU_SCS_FPCCR_LSPEN                                         0x40000000
#define CPU_SCS_FPCCR_LSPEN_BITN                                            30
#define CPU_SCS_FPCCR_LSPEN_M                                       0x40000000
#define CPU_SCS_FPCCR_LSPEN_S                                               30

// Field:     [8] MONRDY
//
// Indicates whether the the software executing when the processor allocated
// the FP stack frame was able to set the DebugMonitor exception to pending.
// 0: DebugMonitor is disabled or priority did not permit setting
// DEMCR.MON_PEND when the floating-point stack frame was allocated.
// 1: DebugMonitor is enabled and priority permits setting DEMCR.MON_PEND when
// the floating-point stack frame was allocated.
#define CPU_SCS_FPCCR_MONRDY                                        0x00000100
#define CPU_SCS_FPCCR_MONRDY_BITN                                            8
#define CPU_SCS_FPCCR_MONRDY_M                                      0x00000100
#define CPU_SCS_FPCCR_MONRDY_S                                               8

// Field:     [6] BFRDY
//
// Indicates whether the software executing when the processor allocated the FP
// stack frame was able to set the BusFault exception to pending.
// 0: BusFault is disabled or priority did not permit setting the BusFault
// handler to the pending state when the floating-point stack frame was
// allocated.
// 1: BusFault is enabled and priority permitted setting the BusFault handler
// to the pending state when the floating-point stack frame was allocated.
#define CPU_SCS_FPCCR_BFRDY                                         0x00000040
#define CPU_SCS_FPCCR_BFRDY_BITN                                             6
#define CPU_SCS_FPCCR_BFRDY_M                                       0x00000040
#define CPU_SCS_FPCCR_BFRDY_S                                                6

