aws/amazon-freertos/vendors/ti/SimpleLink_CC32xx/v4_30_00_06/source/ti/drivers/itm/hw_cpu_scs.h
// Field:     [5] MMRDY
//
// Indicates whether the software executing when the processor allocated the FP
// stack frame was able to set the MemManage exception to pending.
// 0: MemManage is disabled or priority did not permit setting the MemManage
// handler to the pending state when the floating-point stack frame was
// allocated.
// 1: MemManage is enabled and priority permitted setting the MemManage handler
// to the pending state when the floating-point stack frame was allocated.
#define CPU_SCS_FPCCR_MMRDY                                         0x00000020
#define CPU_SCS_FPCCR_MMRDY_BITN                                             5
#define CPU_SCS_FPCCR_MMRDY_M                                       0x00000020
#define CPU_SCS_FPCCR_MMRDY_S                                                5

// Field:     [4] HFRDY
//
// Indicates whether the software executing when the processor allocated the FP
// stack frame was able to set the HardFault exception to pending.
// 0: Priority did not permit setting the HardFault handler to the pending
// state when the floating-point stack frame was allocated.
// 1: Priority permitted setting the HardFault handler to the pending state
// when the floating-point stack frame was allocated.
#define CPU_SCS_FPCCR_HFRDY                                         0x00000010
#define CPU_SCS_FPCCR_HFRDY_BITN                                             4
#define CPU_SCS_FPCCR_HFRDY_M                                       0x00000010
#define CPU_SCS_FPCCR_HFRDY_S                                                4

// Field:     [3] THREAD
//
// Indicates the processor mode was Thread when it allocated the FP stack
// frame.
// 0: Mode was not Thread Mode when the floating-point stack frame was
// allocated.
// 1: Mode was Thread Mode when the floating-point stack frame was allocated.
#define CPU_SCS_FPCCR_THREAD                                        0x00000008
#define CPU_SCS_FPCCR_THREAD_BITN                                            3
#define CPU_SCS_FPCCR_THREAD_M                                      0x00000008
#define CPU_SCS_FPCCR_THREAD_S                                               3

// Field:     [1] USER
//
// Indicates the privilege level of the software executing was User
// (Unpriviledged) when the processor allocated the FP stack frame:
// 0: Privilege level was not user when the floating-point stack frame was
// allocated.
// 1: Privilege level was user when the floating-point stack frame was
// allocated.
#define CPU_SCS_FPCCR_USER                                          0x00000002
#define CPU_SCS_FPCCR_USER_BITN                                              1
#define CPU_SCS_FPCCR_USER_M                                        0x00000002
#define CPU_SCS_FPCCR_USER_S                                                 1

// Field:     [0] LSPACT
//
// Indicates whether Lazy preservation of the FP state is active:
// 0: Lazy state preservation is not active.
// 1: Lazy state preservation is active. floating-point stack frame has been
// allocated but saving state to it has been deferred.
#define CPU_SCS_FPCCR_LSPACT                                        0x00000001
#define CPU_SCS_FPCCR_LSPACT_BITN                                            0
#define CPU_SCS_FPCCR_LSPACT_M                                      0x00000001
#define CPU_SCS_FPCCR_LSPACT_S                                               0

//*****************************************************************************
//
// Register: CPU_SCS_O_FPCAR
//
//*****************************************************************************
// Field:  [31:2] ADDRESS
//
// Holds the (double-word-aligned) location of the unpopulated floating-point
// register space allocated on an exception stack frame.
#define CPU_SCS_FPCAR_ADDRESS_W                                             30
#define CPU_SCS_FPCAR_ADDRESS_M                                     0xFFFFFFFC
#define CPU_SCS_FPCAR_ADDRESS_S                                              2

//*****************************************************************************
//
// Register: CPU_SCS_O_FPDSCR
//
//*****************************************************************************
// Field:    [26] AHP
//
// Default value for Alternative Half Precision bit. (If this bit is set to 1
// then Alternative half-precision format is selected).
#define CPU_SCS_FPDSCR_AHP                                          0x04000000
#define CPU_SCS_FPDSCR_AHP_BITN                                             26
#define CPU_SCS_FPDSCR_AHP_M                                        0x04000000
#define CPU_SCS_FPDSCR_AHP_S                                                26

// Field:    [25] DN
//
// Default value for Default NaN mode bit. (If this bit is set to 1 then any
// operation involving one or more NaNs returns the Default NaN).
#define CPU_SCS_FPDSCR_DN                                           0x02000000
#define CPU_SCS_FPDSCR_DN_BITN                                              25
#define CPU_SCS_FPDSCR_DN_M                                         0x02000000
#define CPU_SCS_FPDSCR_DN_S                                                 25

// Field:    [24] FZ
//
// Default value for Flush-to-Zero mode bit. (If this bit is set to 1 then
// Flush-to-zero mode is enabled).
#define CPU_SCS_FPDSCR_FZ                                           0x01000000
#define CPU_SCS_FPDSCR_FZ_BITN                                              24
#define CPU_SCS_FPDSCR_FZ_M                                         0x01000000
#define CPU_SCS_FPDSCR_FZ_S                                                 24

// Field: [23:22] RMODE
//
// Default value for Rounding Mode control field. (The encoding for this field
// is:
// 0b00 Round to Nearest (RN) mode
// 0b01 Round towards Plus Infinity (RP) mode
// 0b10 Round towards Minus Infinity (RM) mode
// 0b11 Round towards Zero (RZ) mode.
// The specified rounding mode is used by almost all floating-point
// instructions).
#define CPU_SCS_FPDSCR_RMODE_W                                               2
#define CPU_SCS_FPDSCR_RMODE_M                                      0x00C00000
#define CPU_SCS_FPDSCR_RMODE_S                                              22

//*****************************************************************************
//
// Register: CPU_SCS_O_MVFR0
//
//*****************************************************************************
// Field: [31:28] FP_ROUNDING_MODES
//
// Indicates the rounding modes supported by the FP floating-point hardware.
// The value of this field is: 0b0001 - all rounding modes supported.
#define CPU_SCS_MVFR0_FP_ROUNDING_MODES_W                                    4
#define CPU_SCS_MVFR0_FP_ROUNDING_MODES_M                           0xF0000000
#define CPU_SCS_MVFR0_FP_ROUNDING_MODES_S                                   28

