aws/amazon-freertos/vendors/ti/SimpleLink_CC32xx/v4_30_00_06/source/ti/drivers/itm/hw_cpu_scs.h
// Field: [27:24] SHORT_VECTORS
//
// Indicates the hardware support for FP short vectors. The value of this field
// is: 0b0000 - not supported.
#define CPU_SCS_MVFR0_SHORT_VECTORS_W                                        4
#define CPU_SCS_MVFR0_SHORT_VECTORS_M                               0x0F000000
#define CPU_SCS_MVFR0_SHORT_VECTORS_S                                       24

// Field: [23:20] SQUARE_ROOT
//
// Indicates the hardware support for FP square root operations. The value of
// this field is: 0b0001 - supported.
#define CPU_SCS_MVFR0_SQUARE_ROOT_W                                          4
#define CPU_SCS_MVFR0_SQUARE_ROOT_M                                 0x00F00000
#define CPU_SCS_MVFR0_SQUARE_ROOT_S                                         20

// Field: [19:16] DIVIDE
//
// Indicates the hardware support for FP divide operations. The value of this
// field is: 0b0001 - supported.
#define CPU_SCS_MVFR0_DIVIDE_W                                               4
#define CPU_SCS_MVFR0_DIVIDE_M                                      0x000F0000
#define CPU_SCS_MVFR0_DIVIDE_S                                              16

// Field: [15:12] FP_EXCEPTION_TRAPPING
//
// Indicates whether the FP hardware implementation supports exception
// trapping. The value of this field is: 0b0000 - not supported.
#define CPU_SCS_MVFR0_FP_EXCEPTION_TRAPPING_W                                4
#define CPU_SCS_MVFR0_FP_EXCEPTION_TRAPPING_M                       0x0000F000
#define CPU_SCS_MVFR0_FP_EXCEPTION_TRAPPING_S                               12

// Field:  [11:8] DOUBLE_PRECISION
//
// Indicates the hardware support for FP double-precision operations. The value
// of this field is: 0b0000 - not supported.
#define CPU_SCS_MVFR0_DOUBLE_PRECISION_W                                     4
#define CPU_SCS_MVFR0_DOUBLE_PRECISION_M                            0x00000F00
#define CPU_SCS_MVFR0_DOUBLE_PRECISION_S                                     8

// Field:   [7:4] SINGLE_PRECISION
//
// Indicates the hardware support for FP single-precision operations. The value
// of this field is: 0b0010 - supported.
#define CPU_SCS_MVFR0_SINGLE_PRECISION_W                                     4
#define CPU_SCS_MVFR0_SINGLE_PRECISION_M                            0x000000F0
#define CPU_SCS_MVFR0_SINGLE_PRECISION_S                                     4

// Field:   [3:0] A_SIMD
//
// Indicates the size of the FP register bank. The value of this field is:
// 0b0001 - supported, 16 x 64-bit registers.
#define CPU_SCS_MVFR0_A_SIMD_W                                               4
#define CPU_SCS_MVFR0_A_SIMD_M                                      0x0000000F
#define CPU_SCS_MVFR0_A_SIMD_S                                               0

//*****************************************************************************
//
// Register: CPU_SCS_O_MVFR1
//
//*****************************************************************************
// Field: [31:28] FP_FUSED_MAC
//
// Indicates whether the FP supports fused multiply accumulate operations. The
// value of this field is: 0b0001 - supported.
#define CPU_SCS_MVFR1_FP_FUSED_MAC_W                                         4
#define CPU_SCS_MVFR1_FP_FUSED_MAC_M                                0xF0000000
#define CPU_SCS_MVFR1_FP_FUSED_MAC_S                                        28

// Field: [27:24] FP_HPFP
//
// Indicates whether the FP supports half-precision floating-point conversion
// operations. The value of this field is: 0b0001 - supported.
#define CPU_SCS_MVFR1_FP_HPFP_W                                              4
#define CPU_SCS_MVFR1_FP_HPFP_M                                     0x0F000000
#define CPU_SCS_MVFR1_FP_HPFP_S                                             24

// Field:   [7:4] D_NAN_MODE
//
// Indicates whether the FP hardware implementation supports only the Default
// NaN mode. The value of this field is: 0b0001 - hardware supports propagation
// of NaN values.
#define CPU_SCS_MVFR1_D_NAN_MODE_W                                           4
#define CPU_SCS_MVFR1_D_NAN_MODE_M                                  0x000000F0
#define CPU_SCS_MVFR1_D_NAN_MODE_S                                           4

// Field:   [3:0] FTZ_MODE
//
// Indicates whether the FP hardware implementation supports only the
// Flush-to-Zero mode of operation. The value of this field is: 0b0001 -
// hardware supports full denormalized number arithmetic.
#define CPU_SCS_MVFR1_FTZ_MODE_W                                             4
#define CPU_SCS_MVFR1_FTZ_MODE_M                                    0x0000000F
#define CPU_SCS_MVFR1_FTZ_MODE_S                                             0


#endif // __CPU_SCS__
